In [3]:
# import the pandas library as "pd"

import pandas as pd

In [3]:
# read the titanic.csv file and create a dataframe from it using the appropriade method of pandas library

my_df = pd.read_csv("titanic.csv")

In [7]:
#methods - are followed by parenthesis

# Quick exploration for the dataset, .head() returns the first 5 rows by default.

my_df.head()


#discplays names of columns, the data types they contain and where the have any missing values.

homelessness.info()

# compute some summary statistics for numerical columns like mean and median
# count is the number of non-missing values in each column

homelessness.describe()

# attributes - are not followed by parenthesis

# returns a tuple that holds the number of rows followed by the number of columns.
homelessness.shape

# represent the data values in a 2-dimensional NumPy array.
homelessness.values

# represent column names in a list
homelessness.columns

# show the row numbers or row names
homelessness.index

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      51 non-null     int64
 1   region          51 non-null     object
 2   state           51 non-null     object
 3   individuals     51 non-null     float64
 4   family_members  51 non-null     float64
 5   state_pop       51 non-null     int64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.5+ KB

RangeIndex(start=0, stop=51, step=1)

# Inspecting a DataFrame
When you get a new DataFrame to work with, the first thing you need to do is explore it and see what it contains. There are several useful methods and attributes for this.

- .head() returns the first few rows (the “head” of the DataFrame).
- .info() shows information on each of the columns, such as the data type and number of missing values.
- .shape returns the number of rows and columns of the DataFrame.
- .describe() calculates a few summary statistics for each column.

homelessness is a DataFrame containing estimates of homelessness in each U.S. state in 2018. The individual column is the number of homeless individuals not part of a family with children. The family_members column is the number of homeless individuals part of a family with children. The state_pop column is the state's total population

In [13]:
# Print the column index of homelessness

print (my_df.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [19]:
# Print the row index of homelessness

print (my_df.index)

RangeIndex(start=0, stop=892, step=1)

In [12]:
# Print some values of titanic dataframe

print (my_df.values)

[[0.0 3.0 'male' ... 'Southampton' 'no' False]
 [1.0 1.0 'female' ... 'Cherbourg' 'yes' False]
 [1.0 3.0 'female' ... 'Southampton' 'yes' True]
 ...
 [0.0 3.0 'female' ... 'Southampton' 'no' False]
 [1.0 1.0 'male' ... 'Cherbourg' 'yes' True]
 [0.0 3.0 'male' ... 'Queenstown' 'no' True]]

In [6]:
# Print the head of the titanic dataframe and check how many rows of this dataframe are printed

print (my_df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0       0.0     3.0    male  22.0      1      0   7.2500        S  Third
1       1.0     1.0  female  38.0      1      0  71.2833        C  First
2       1.0     3.0  female  26.0      0      0   7.9250        S  Third
3       1.0     1.0  female  35.0      1      0  53.1000        S  First
4       0.0     3.0    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [9]:
# Print the first 10 rows of the titanic dataframe

print (my_df.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0       0.0     3.0    male  22.0      1      0   7.2500        S   Third
1       1.0     1.0  female  38.0      1      0  71.2833        C   First
2       1.0     3.0  female  26.0      0      0   7.9250        S   Third
3       1.0     1.0  female  35.0      1      0  53.1000        S   First
4       0.0     3.0    male  35.0      0      0   8.0500        S   Third
5       0.0     3.0    male   NaN      0      0   8.4583        Q   Third
6       0.0     1.0    male  54.0      0      0  51.8625        S   First
7       0.0     3.0    male   2.0      3      1  21.0750        S   Third
8       1.0     3.0  female  27.0      0      2  11.1333        S   Third
9       1.0     2.0  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no    NaN
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [18]:
# Print the first 22 rows of the titanic dataframe

print (my_df.head(22))

    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0        0.0     3.0    male  22.0      1      0   7.2500        S   Third
1        1.0     1.0  female  38.0      1      0  71.2833        C   First
2        1.0     3.0  female  26.0      0      0   7.9250        S   Third
3        1.0     1.0  female  35.0      1      0  53.1000        S   First
4        0.0     3.0    male  35.0      0      0   8.0500        S   Third
5        0.0     3.0    male   NaN      0      0   8.4583        Q   Third
6        0.0     1.0    male  54.0      0      0  51.8625        S   First
7        0.0     3.0    male   2.0      3      1  21.0750        S   Third
8        1.0     3.0  female  27.0      0      2  11.1333        S   Third
9        1.0     2.0  female  14.0      1      0  30.0708        C  Second
10       1.0     3.0  female   4.0      1      1  16.7000        S   Third
11       1.0     1.0  female  58.0      0      0      NaN        S   First
12       0.0     3.0    male  20.0      0      0   8.0500        S   Third
13       0.0     3.0    male  39.0      1      5  31.2750        S   Third
14       0.0     3.0  female  14.0      0      0   7.8542        S   Third
15       1.0     2.0  female  55.0      0      0  16.0000        S  Second
16       0.0     3.0    male   2.0      4      1  29.1250        Q   Third
17       1.0     2.0    male   NaN      0      0  13.0000        S  Second
18       0.0     3.0  female  31.0      1      0  18.0000        S   Third
19       1.0     3.0  female   NaN      0      0   7.2250        C   Third
20       0.0     2.0    male  35.0      0      0  26.0000        S  Second
21       1.0     2.0    male  34.0      0      0  13.0000        S  Second

      who  adult_male deck  embark_town alive  alone
0     man        True  NaN  Southampton    no  False
1   woman       False    C    Cherbourg   yes  False
2   woman       False  NaN  Southampton   yes   True
3   woman       False    C  Southampton   yes  False
4     man        True  NaN  Southampton    no   True
5     man        True  NaN   Queenstown    no    NaN
6     man        True    E  Southampton    no   True
7   child       False  NaN  Southampton    no  False
8   woman       False  NaN  Southampton   yes  False
9   child       False  NaN    Cherbourg   yes  False
10  child       False    G  Southampton   yes  False
11  woman       False    C  Southampton   yes   True
12    man        True  NaN  Southampton    no   True
13    man        True  NaN  Southampton    no  False
14  child       False  NaN  Southampton    no   True
15  woman       False  NaN  Southampton   yes   True
16  child       False  NaN   Queenstown    no  False
17    man        True  NaN  Southampton   yes   True
18  woman       False  NaN  Southampton    no  False
19  woman       False  NaN    Cherbourg   yes   True
20    man        True  NaN  Southampton    no   True
21    man        True    D  Southampton   yes   True

In [15]:
# Print the last 5 rows of the titanic dataframe

print (my_df.tail())

     survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
887       0.0     2.0    male  27.0      0      0  13.00        S  Second
888       1.0     1.0  female  19.0      0      0  30.00        S   First
889       0.0     3.0  female   NaN      1      2  23.45        S   Third
890       1.0     1.0    male  26.0      0      0  30.00        C   First
891       0.0     3.0    male  32.0      0      0   7.75        Q   Third

       who  adult_male deck  embark_town alive  alone
887    man        True  NaN  Southampton    no   True
888  woman       False    B  Southampton   yes   True
889  woman       False  NaN  Southampton    no  False
890    man        True    C    Cherbourg   yes   True
891    man        True  NaN   Queenstown    no   True

In [16]:
# Print the last 10 rows of the titanic dataframe

print (my_df.tail(10))

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
882       0.0     3.0    male  33.0      0      0   7.8958        S   Third
883       0.0     3.0  female  22.0      0      0  10.5167        S   Third
884       0.0     2.0    male  28.0      0      0  10.5000        S  Second
885       0.0     3.0    male  25.0      0      0   7.0500        S   Third
886       0.0     3.0  female  39.0      0      5  29.1250        Q   Third
887       0.0     2.0    male  27.0      0      0  13.0000        S  Second
888       1.0     1.0  female  19.0      0      0  30.0000        S   First
889       0.0     3.0  female   NaN      1      2  23.4500        S   Third
890       1.0     1.0    male  26.0      0      0  30.0000        C   First
891       0.0     3.0    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
882    man        True  NaN  Southampton    no   True
883  woman       False  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
885    man        True  NaN  Southampton    no   True
886  woman       False  NaN   Queenstown    no  False
887    man        True  NaN  Southampton    no   True
888  woman       False    B  Southampton   yes   True
889  woman       False  NaN  Southampton    no  False
890    man        True    C    Cherbourg   yes   True
891    man        True  NaN   Queenstown    no   True

In [17]:
# Print the last 22 rows of the titanic dataframe

print (my_df.tail(22))

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
870       1.0     3.0    male   4.0      1      1  11.1333        S   Third
871       0.0     3.0    male  26.0      0      0   7.8958        S   Third
872       1.0     1.0  female  47.0      1      1  52.5542        S   First
873       0.0     1.0    male  33.0      0      0   5.0000        S   First
874       0.0     3.0    male  47.0      0      0   9.0000        S   Third
875       1.0     2.0  female  28.0      1      0  24.0000        C  Second
876       1.0     3.0  female  15.0      0      0   7.2250        C   Third
877       0.0     3.0    male  20.0      0      0   9.8458        S   Third
878       0.0     3.0    male  19.0      0      0   7.8958        S   Third
879       0.0     3.0    male   NaN      0      0   7.8958        S   Third
880       1.0     1.0  female  56.0      0      1  83.1583        C   First
881       1.0     2.0  female  25.0      0      1  26.0000        S  Second
882       0.0     3.0    male  33.0      0      0   7.8958        S   Third
883       0.0     3.0  female  22.0      0      0  10.5167        S   Third
884       0.0     2.0    male  28.0      0      0  10.5000        S  Second
885       0.0     3.0    male  25.0      0      0   7.0500        S   Third
886       0.0     3.0  female  39.0      0      5  29.1250        Q   Third
887       0.0     2.0    male  27.0      0      0  13.0000        S  Second
888       1.0     1.0  female  19.0      0      0  30.0000        S   First
889       0.0     3.0  female   NaN      1      2  23.4500        S   Third
890       1.0     1.0    male  26.0      0      0  30.0000        C   First
891       0.0     3.0    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
870  child       False  NaN  Southampton   yes  False
871    man        True  NaN  Southampton    no   True
872  woman       False    D  Southampton   yes  False
873    man        True    B  Southampton    no   True
874    man        True  NaN  Southampton    no   True
875  woman       False  NaN    Cherbourg   yes  False
876  child       False  NaN    Cherbourg   yes   True
877    man        True  NaN  Southampton    no   True
878    man        True  NaN  Southampton    no   True
879    man        True  NaN  Southampton    no   True
880  woman       False    C    Cherbourg   yes  False
881  woman       False  NaN  Southampton   yes  False
882    man        True  NaN  Southampton    no   True
883  woman       False  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
885    man        True  NaN  Southampton    no   True
886  woman       False  NaN   Queenstown    no  False
887    man        True  NaN  Southampton    no   True
888  woman       False    B  Southampton   yes   True
889  woman       False  NaN  Southampton    no  False
890    man        True    C    Cherbourg   yes   True
891    man        True  NaN   Queenstown    no   True

In [21]:
# How many Non-null values has each column and which is the Datatype for each one?

print(my_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    float64
 1   pclass       891 non-null    float64
 2   sex          891 non-null    object
 3   age          715 non-null    float64
 4   sibsp        892 non-null    int64
 5   parch        892 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     890 non-null    object
 8   class        892 non-null    object
 9   who          892 non-null    object
 10  adult_male   892 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        892 non-null    object
 14  alone        891 non-null    object
dtypes: bool(1), float64(4), int64(2), object(8)
memory usage: 98.6+ KB
None

In [8]:
# How many rows and columns has the titanic dataframe?

print(my_df.shape)

(892, 15)

In [11]:
# compute some summary statistics(mean, standard deviation, min-max values) and the number of non-missing values in each column

print(my_df.describe())

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  715.000000  892.000000  892.000000  891.000000
mean     0.383838    2.309764   29.700937    0.522422    0.381166   32.183136
std      0.486592    0.834983   14.516403    1.102264    0.805706   49.699809
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.250000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

# Sorting and subsetting

In [22]:
# Print the head of the titanic dataframe in a dataframe format

my_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Sorting

In [25]:
# sort my_df on the 'class' column in ascending order

my_df.sort_values("class")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
445,1.0,1.0,male,4.0,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
779,1.0,1.0,female,43.0,0,1,211.3375,S,First,woman,False,B,Southampton,yes,False
177,0.0,1.0,female,50.0,0,0,28.7125,C,First,woman,False,C,Cherbourg,no,True
660,1.0,1.0,male,50.0,2,0,133.6500,S,First,man,True,NaN,Southampton,yes,False
662,0.0,1.0,male,47.0,0,0,25.5875,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
379,0.0,3.0,male,19.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
381,1.0,3.0,female,1.0,0,2,15.7417,C,Third,child,False,NaN,Cherbourg,yes,False
382,0.0,3.0,male,32.0,0,0,7.9250,S,Third,man,True,NaN,Southampton,no,True
371,0.0,3.0,male,18.0,1,0,6.4958,S,Third,man,True,NaN,Southampton,no,False
891,0.0,3.0,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
# sort my_df on the 'class' column in descending order

my_df.sort_values("class", ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
514,0.0,3.0,male,24.0,0,0,7.4958,S,Third,man,True,NaN,Southampton,no,True
501,0.0,3.0,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
502,0.0,3.0,female,NaN,0,0,7.6292,Q,Third,woman,False,NaN,Queenstown,no,True
503,0.0,3.0,female,37.0,0,0,9.5875,S,Third,woman,False,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
712,1.0,1.0,male,48.0,1,0,52.0000,S,First,man,True,C,Southampton,yes,False
102,0.0,1.0,male,21.0,0,1,77.2875,S,First,man,True,D,Southampton,no,False
467,0.0,1.0,male,56.0,0,0,26.5500,S,First,man,True,NaN,Southampton,no,True
716,1.0,1.0,female,38.0,0,0,227.5250,C,First,woman,False,C,Cherbourg,yes,True
602,0.0,1.0,male,NaN,0,0,42.4000,S,First,man,True,NaN,Southampton,no,True

In [27]:
# sort my_df on the 'class' column and on the 'embark_town' column

my_df.sort_values(["class", "embark_town"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.00,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
30,0.0,1.0,male,40.00,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
31,1.0,1.0,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
34,0.0,1.0,male,28.00,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False
52,1.0,1.0,female,49.00,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
882,0.0,3.0,male,33.00,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0.0,3.0,female,22.00,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0.0,3.0,male,25.00,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
804,1.0,3.0,male,0.42,0,1,8.5167,C,Third,child,False,NaN,NaN,yes,False

In [28]:
# sort my_df on the 'class' column in descending order and on the 'embark_town' column in ascending order

my_df.sort_values(["class", "embark_town"], ascending=[False,True])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
19,1.0,3.0,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0.0,3.0,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
36,1.0,3.0,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
39,1.0,3.0,female,14.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False
42,0.0,3.0,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
872,1.0,1.0,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
873,0.0,1.0,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
61,1.0,1.0,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
830,1.0,1.0,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True

In [28]:
# sort my_df on the 'class' column in descending order and on the 'embark_town' column in ascending order

my_df.sort_values(["class", "embark_town"], ascending=[False,True])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
19,1.0,3.0,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0.0,3.0,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
36,1.0,3.0,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
39,1.0,3.0,female,14.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False
42,0.0,3.0,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
872,1.0,1.0,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
873,0.0,1.0,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
61,1.0,1.0,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
830,1.0,1.0,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True

### Subsetting

In [33]:
# print a pandas series of True / False values based on the condition "fare" column values greater than 10

my_df["fare"] > 10

0      False
1       True
2      False
3       True
4      False
       ...
887     True
888     True
889     True
890     True
891    False
Name: fare, Length: 892, dtype: bool

In [35]:
# subset the dataframe based on the condition where "fare" value is greater than 10

my_df[my_df["fare"] > 10]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1.0,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0.0,3.0,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1.0,3.0,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,0.0,2.0,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,1.0,1.0,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [36]:
# subset the dataframe based on the condition where "fare" value is less than 20

my_df[my_df["fare"] > 20]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1.0,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0.0,3.0,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
9,1.0,2.0,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,1.0,2.0,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,1.0,1.0,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [37]:
# subset the dataframe based on the condition where "who" column value is 'woman'

my_df[my_df["who"] == "woman"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1.0,3.0,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
11,1.0,1.0,female,58.0,0,0,NaN,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,1.0,2.0,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0.0,3.0,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [39]:
# subset the dataframe based on the condition where "who" column value is 'woman' or 'child' 

my_df[(my_df["who"] == "woman") | (my_df["who"] == "child")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
7,0.0,3.0,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1.0,3.0,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,1.0,2.0,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0.0,3.0,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [41]:
# subset the dataframe based on the condition where "embark_town" column value is 'Southampton' and the "who" column value is 'man' 

my_df[(my_df["embark_town"] == "Southampton") & (my_df["who"] == "man")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0.0,3.0,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0.0,1.0,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
12,0.0,3.0,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0.0,3.0,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
879,0.0,3.0,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
882,0.0,3.0,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
884,0.0,2.0,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
885,0.0,3.0,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
887,0.0,2.0,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True

In [45]:
# subset the dataframe to show only rows where embark_town is in "Southampton" or "Cherbourg"

my_df[my_df["embark_town"].isin(["Southampton","Cherbourg"])]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0.0,3.0,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
887,0.0,2.0,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,1.0,1.0,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

embark_town
Cherbourg      1
Queenstown     1
Southampton    1
Name: embark_town, dtype: int64